walczakkamil/lora_aprs_reapeter/STM32/Core/Src/main.c
#include "stm32f1xx_hal.h"
#include <string.h>
#include <stdio.h>
#include <stdarg.h>

/* =============================================================================
 * Logging / debug options
 * =============================================================================
 * You can control UART verbosity without touching the main radio logic.
 *
 * Compile-time:
 *   - Define DEBUG (e.g. -DDEBUG) to get a more verbose default.
 *   - Or override APP_LOG_LEVEL_DEFAULT explicitly.
 *
 * Levels:
 *   0 = OFF   (no UART logs; PANIC still prints)
 *   1 = ERROR
 *   2 = INFO
 *   3 = DEBUG
 *
 * Optional features:
 *   - APP_LOG_AUTO_MUTE_MS:
 *       If > 0, automatically disables UART logs after N ms from boot.
 *   - APP_LOG_SERVICE_PIN_ENABLE:
 *       If 1, a "service pin" (button/jumper) forces logs ON at boot.
 *
 * Runtime:
 *   - UART_LogEnable(1/0) toggles the log gate.
 *   - LOG_SetLevel(...) changes verbosity.
 * =============================================================================
 */
#define APP_LOG_LEVEL_DEFAULT 0u

#ifndef APP_LOG_LEVEL_DEFAULT
  #ifdef DEBUG
    #define APP_LOG_LEVEL_DEFAULT 3u
  #else
    #define APP_LOG_LEVEL_DEFAULT 2u
  #endif
#endif

#ifndef APP_LOG_AUTO_MUTE_MS
  #define APP_LOG_AUTO_MUTE_MS 0u
#endif

#ifndef APP_LOG_SERVICE_PIN_ENABLE
  #define APP_LOG_SERVICE_PIN_ENABLE 0u
#endif

#if (APP_LOG_SERVICE_PIN_ENABLE)
  #ifndef APP_LOG_SERVICE_GPIO_Port
    #define APP_LOG_SERVICE_GPIO_Port GPIOB
  #endif
  #ifndef APP_LOG_SERVICE_Pin
    #define APP_LOG_SERVICE_Pin GPIO_PIN_12
  #endif
  #ifndef APP_LOG_SERVICE_PIN_ACTIVE
    #define APP_LOG_SERVICE_PIN_ACTIVE GPIO_PIN_RESET
  #endif
#endif


/**
 * @file main.c
 * @brief Dual SX127x (RFM9x) LoRa receive + forward firmware (STM32F103).
 *
 * Features:
 *  - Two SX127x radios on a shared SPI bus (separate NSS/RESET/DIO0).
 *  - RX1 runs in continuous RX and captures LoRa frames.
 *  - RX2 is used as a low-duty TX forwarder (stays in STDBY most of the time to save power).
 *  - UART logging is gated by a runtime flag (g_uart_log_enabled) to reduce power usage.
 *  - A panic path (system_panic_reset) always emits a short message and resets the MCU.
 *
 * Notes:
 *  - This file is intentionally self-contained (minimal init helpers included).
 *  - Pin mapping must match your CubeMX project / board wiring.
 */

/* ===== Global buffers to reduce stack usage (prevents hardfault-like hangs) ===== */
/// @brief Shared UART formatting buffer (global to reduce stack usage).
static char g_uart_buf[256];
/// @brief Shared APRS dump buffer (HEX/ASCII output formatting).
static char g_aprs_out[240];
/// @brief RX1 raw payload buffer (max 128 bytes in this demo).
static uint8_t g_rx_buf_1[128];
/// @brief RX2 raw payload buffer (not used when RX2 is disabled; kept for symmetry).
static uint8_t g_rx_buf_2[128];

/* TX queue for Radio2 forwarding */
/// @brief Queued payload to forward on RX2 (TX buffer).
static uint8_t g_tx_buf_2[128];
/// @brief Length of queued TX payload for RX2.
static volatile uint8_t g_tx_len_2 = 0;
/// @brief Set to 1 when there is a payload pending TX on RX2.
static volatile uint8_t g_tx_pending_2 = 0;

/// @brief Simple watchdog counter for repeated CRC errors.
static uint8_t crc_storm = 0;

/* =========================================================
   TWO SX127x MODULES ON A SINGLE SPI1 BUS (Variant A)

   Shared SPI1:
     SCK  PA5
     MISO PA6
     MOSI PA7

   Radio RX1:
     NSS/CS  PA4
     RST     PB0
     DIO0    PB1  (EXTI1)

   Radio RX2:
     NSS/CS  PA3
     RST     PB10
     DIO0    PB11 (EXTI15_10)

   UART1:
     TX PA9
     RX PA10

   LED (CubeMX) e.g. PC13 (depends on your board/project).
   ========================================================= */


/* ===================== Handles ===================== */
SPI_HandleTypeDef hspi1;
UART_HandleTypeDef huart1;

/* ===================== Radio IDs ===================== */
#define RID_RX1 1
#define RID_RX2 2

/* ===================== GPIO mapping (DOPASUJ JEŚLI INNE) ===================== */
#define RX1_NSS_GPIO_Port GPIOA
#define RX1_NSS_Pin       GPIO_PIN_4
#define RX2_NSS_GPIO_Port GPIOA
#define RX2_NSS_Pin       GPIO_PIN_3

#define RX1_RST_GPIO_Port GPIOB
#define RX1_RST_Pin       GPIO_PIN_0
#define RX2_RST_GPIO_Port GPIOB
#define RX2_RST_Pin       GPIO_PIN_10

#define RX1_DIO0_GPIO_Port GPIOB
#define RX1_DIO0_Pin       GPIO_PIN_1
#define RX2_DIO0_GPIO_Port GPIOB
#define RX2_DIO0_Pin       GPIO_PIN_11

/* LED from CubeMX (jeśli nie masz LED_GPIO_Port/LED_Pin w main.h, usuń miganie) */
#ifndef LED_GPIO_Port
#define LED_GPIO_Port GPIOC
#endif
#ifndef LED_Pin
#define LED_Pin GPIO_PIN_13

/* =============================================================================
 * LED blink helper (non-blocking, low-power friendly)
 * =============================================================================
 * Motivation:
 *  - Do NOT use HAL_GPIO_TogglePin() on RX/TX events, because it can leave the LED
 *    ON for a long time (wasting power) depending on packet timing.
 *
 * Behavior:
 *  - RX event  -> 1 short blink
 *  - TX event  -> 2 short blinks
 *
 * Implementation:
 *  - Non-blocking state machine driven by HAL_GetTick().
 *  - Call LED_Task() regularly from the main loop.
 * =============================================================================
 */

typedef struct
{
  uint8_t transitions_left;   /**< Remaining ON/OFF transitions (2 per blink). */
  uint8_t phase;              /**< 0 = LED OFF, 1 = LED ON. */
  uint32_t next_tick;         /**< Next tick to toggle LED phase. */
} led_blink_t;

static led_blink_t g_led = {0};

#ifndef LED_ON_TIME_MS
#define LED_ON_TIME_MS  40u
#endif
#ifndef LED_OFF_TIME_MS
#define LED_OFF_TIME_MS 60u
#endif

#define LED_ON()   HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET)
#define LED_OFF()  HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET)


/**
 * @brief Schedule N LED blinks (non-blocking).
 * @param count Number of blinks to perform (1=RX, 2=TX).
 */
static void LED_Blink(uint8_t count)
{
  if (count == 0) return;

  /* Each blink consists of ON + OFF => 2 transitions. */
  g_led.transitions_left = (uint8_t)(count * 2u);
  g_led.phase = 0;
  g_led.next_tick = HAL_GetTick();
}

/**
 * @brief LED state machine task (call from the main loop).
 */
static void LED_Task(void)
{
  if (g_led.transitions_left == 0) return;

  uint32_t now = HAL_GetTick();
  if ((int32_t)(now - g_led.next_tick) < 0) return;

  if (g_led.phase == 0)
  {
	LED_ON();
    g_led.phase = 1;
    g_led.next_tick = now + LED_ON_TIME_MS;
  }
  else
  {
	LED_OFF();
    g_led.phase = 0;
    g_led.transitions_left--;
    g_led.next_tick = now + LED_OFF_TIME_MS;
  }
}

#endif

/* =========================
   SX127x registers (LoRa mode)
   ========================= */
#define REG_FIFO                    0x00
#define REG_OP_MODE                 0x01
#define REG_FRF_MSB                 0x06
#define REG_FRF_MID                 0x07
#define REG_FRF_LSB                 0x08
#define REG_PA_CONFIG               0x09
#define REG_LNA                     0x0C
#define REG_FIFO_ADDR_PTR           0x0D
#define REG_FIFO_TX_BASE_ADDR       0x0E
#define REG_FIFO_RX_BASE_ADDR       0x0F
#define REG_FIFO_RX_CURRENT         0x10
#define REG_IRQ_FLAGS               0x12
#define REG_RX_NB_BYTES             0x13
#define REG_PAYLOAD_LENGTH          0x22
#define REG_PKT_SNR_VALUE           0x19
#define REG_PKT_RSSI_VALUE          0x1A
#define REG_MODEM_CONFIG_1          0x1D
#define REG_MODEM_CONFIG_2          0x1E
#define REG_PREAMBLE_MSB            0x20
#define REG_PREAMBLE_LSB            0x21
#define REG_MODEM_CONFIG_3          0x26
#define REG_RSSI_WIDEBAND           0x2C
#define REG_INVERT_IQ               0x33
#define REG_INVERT_IQ2              0x3B
#define REG_SYNC_WORD               0x39
#define REG_DIO_MAPPING_1           0x40
#define REG_DIO_MAPPING_2           0x41
#define REG_VERSION                 0x42

/* =========================
   SX127x modes / flags
   ========================= */
#define LONG_RANGE_MODE             0x80
#define MODE_SLEEP                  0x00
#define MODE_STDBY                  0x01
#define MODE_TX                     0x03
#define MODE_RX_CONTINUOUS          0x05

/* IRQ flags */
#define IRQ_RX_TIMEOUT          0x80
#define IRQ_RX_DONE             0x40
#define IRQ_VALID_HEADER        0x10
#define IRQ_PAYLOAD_CRC_ERROR   0x20
#define IRQ_TX_DONE             0x08

/* =========================
   Konfiguracja LoRa (jak u Ciebie)
   ========================= */
#define RX1_LORA_FREQ_HZ     434855000UL
#define RX2_LORA_FREQ_HZ     434955000UL
#define RX_LORA_SYNCWORD     0x12   // private
#define RX_LORA_INVERT_IQ    0      // 0=normal, 1=inverted IQ

