walczakkamil/lora_aprs_reapeter/STM32/Core/Src/main.c
// BW=125kHz + CR=4/7 + Explicit header
#define RX_LORA_BW_CR_EXPL   0x74
// SF9 + CRC ON
#define RX_LORA_SF_CRC       0x94
// AGC auto
#define RX_LORA_MODEM_CFG3   0x04

/* =========================
   Prototypy
   ========================= */
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_SPI1_Init(void);
void Error_Handler(void);


/* =========================
 * UART / logging helpers
 * ========================= */

/**
 * @brief Log levels (higher = more verbose).
 */
typedef enum
{
  LOG_LEVEL_OFF   = 0,
  LOG_LEVEL_ERROR = 1,
  LOG_LEVEL_INFO  = 2,
  LOG_LEVEL_DEBUG = 3
} log_level_t;

/**
 * @brief Global log gate. When 0, logs are silent (except PANIC).
 */
static volatile uint8_t g_uart_log_enabled =
#if (APP_LOG_LEVEL_DEFAULT == 0u)
  0u;
#else
  1u;
#endif

/**
 * @brief Global log level (verbosity threshold).
 */
static volatile log_level_t g_log_level = (log_level_t)APP_LOG_LEVEL_DEFAULT;

/**
 * @brief Enable/disable UART logs at runtime (fast kill-switch).
 */
static inline void UART_LogEnable(uint8_t enable)
{
  g_uart_log_enabled = (enable ? 1u : 0u);
}

/**
 * @brief Set log level at runtime.
 */
static inline void LOG_SetLevel(log_level_t level)
{
  g_log_level = level;
}

/**
 * @brief Returns 1 if a message at @p level should be printed.
 */
static inline uint8_t LOG_IsEnabled(log_level_t level)
{
  if (!g_uart_log_enabled) return 0u;
  if ((uint8_t)g_log_level < (uint8_t)level) return 0u;
  return 1u;
}

/**
 * @brief Ungated UART transmit (used for PANIC and other must-print paths).
 */
static void uart_raw_tx(const uint8_t *data, uint16_t len)
{
  if (data == NULL || len == 0) return;
  (void)HAL_UART_Transmit(&huart1, (uint8_t*)data, len, 200);
}

/**
 * @brief Gated UART transmit (normal logs should use this).
 */
static void uart_tx(const uint8_t *data, uint16_t len)
{
  if (!g_uart_log_enabled) return;
  uart_raw_tx(data, len);
}

/**
 * @brief Print formatted log line at given level.
 */
static void LOG_Printf(log_level_t level, const char *fmt, ...)
{
  if (!LOG_IsEnabled(level)) return;

  va_list ap;
  va_start(ap, fmt);
  vsnprintf(g_uart_buf, sizeof(g_uart_buf), fmt, ap);
  va_end(ap);

  uart_raw_tx((const uint8_t*)g_uart_buf, (uint16_t)strlen(g_uart_buf));
}

/* Convenience macros */
#define LOGE(...) LOG_Printf(LOG_LEVEL_ERROR, __VA_ARGS__)
#define LOGI(...) LOG_Printf(LOG_LEVEL_INFO,  __VA_ARGS__)
#define LOGD(...) LOG_Printf(LOG_LEVEL_DEBUG, __VA_ARGS__)

/* Backward-compatible wrappers (treat as INFO) */
static void uart_puts(const char *s)
{
  if (s == NULL) return;
  if (!LOG_IsEnabled(LOG_LEVEL_INFO)) return;
  uart_raw_tx((const uint8_t*)s, (uint16_t)strlen(s));
}

static void uart_printf(const char *fmt, ...)
{
  if (!LOG_IsEnabled(LOG_LEVEL_INFO)) return;

  va_list ap;
  va_start(ap, fmt);
  vsnprintf(g_uart_buf, sizeof(g_uart_buf), fmt, ap);
  va_end(ap);

  uart_raw_tx((const uint8_t*)g_uart_buf, (uint16_t)strlen(g_uart_buf));
}

/**
 * @brief Initialize logging policy (defaults + optional service pin override).
 *
 * Must be called after MX_GPIO_Init() (to read service pin) and after
 * MX_USART1_UART_Init() (to be able to print).
 */
static void LOG_InitFromConfig(void)
{
#if (APP_LOG_LEVEL_DEFAULT == 0u)
  g_uart_log_enabled = 0u;
#else
  g_uart_log_enabled = 1u;
#endif
  g_log_level = (log_level_t)APP_LOG_LEVEL_DEFAULT;

#if (APP_LOG_SERVICE_PIN_ENABLE)
  if (HAL_GPIO_ReadPin(APP_LOG_SERVICE_GPIO_Port, APP_LOG_SERVICE_Pin) == APP_LOG_SERVICE_PIN_ACTIVE)
  {
    g_uart_log_enabled = 1u;
    if ((uint8_t)g_log_level < (uint8_t)LOG_LEVEL_DEBUG)
      g_log_level = LOG_LEVEL_DEBUG;
  }
#endif
}

static void system_panic_reset(const char *reason)
{
  /* Ostatni log – krótki i bezpieczny */
  uart_printf("PANIC: %s -> RESET\r\n", reason);

  /* Daj UARTowi chwilę na wysłanie */
  HAL_Delay(50);

  /* Twardy reset MCU */
  __disable_irq();
  NVIC_SystemReset();

  /* safety – nigdy tu nie wrócimy */
  while (1) {}
}

/**
 * @section spi_lock SPI bus lock
 * The radios share one SPI peripheral. We use a minimal spin-lock to prevent
 * concurrent transfers (e.g. from interrupt context vs. main loop).
 */
static volatile uint8_t spi_busy = 0;
static volatile uint32_t spi_err_count = 0;

static void SPI_Lock(void)   { while (spi_busy) {} spi_busy = 1; }
static void SPI_Unlock(void) { spi_busy = 0; }

/** @brief Assert/deassert NSS (chip select) for a selected radio. */
static inline void RADIO_NSS_LOW(uint8_t rid)
{
  if (rid == RID_RX1) HAL_GPIO_WritePin(RX1_NSS_GPIO_Port, RX1_NSS_Pin, GPIO_PIN_RESET);
  else               HAL_GPIO_WritePin(RX2_NSS_GPIO_Port, RX2_NSS_Pin, GPIO_PIN_RESET);
}
static inline void RADIO_NSS_HIGH(uint8_t rid)
{
  if (rid == RID_RX1) HAL_GPIO_WritePin(RX1_NSS_GPIO_Port, RX1_NSS_Pin, GPIO_PIN_SET);
  else               HAL_GPIO_WritePin(RX2_NSS_GPIO_Port, RX2_NSS_Pin, GPIO_PIN_SET);
}

/* =========================
   Reset SX127x
   ========================= */
static void RADIO_Reset(uint8_t rid)
{
  if (rid == RID_RX1)
  {
    HAL_GPIO_WritePin(RX1_RST_GPIO_Port, RX1_RST_Pin, GPIO_PIN_RESET);
    HAL_Delay(2);
    HAL_GPIO_WritePin(RX1_RST_GPIO_Port, RX1_RST_Pin, GPIO_PIN_SET);
  }
  else
  {
    HAL_GPIO_WritePin(RX2_RST_GPIO_Port, RX2_RST_Pin, GPIO_PIN_RESET);
    HAL_Delay(2);
    HAL_GPIO_WritePin(RX2_RST_GPIO_Port, RX2_RST_Pin, GPIO_PIN_SET);
  }
  HAL_Delay(10);
}

/* =========================
   SPI read/write SX reg
   ========================= */
static uint8_t RADIO_ReadReg(uint8_t rid, uint8_t reg)
{
  uint8_t addr = reg & 0x7F;
  uint8_t val = 0;

  SPI_Lock();
  RADIO_NSS_LOW(rid);

  HAL_StatusTypeDef st1 = HAL_SPI_Transmit(&hspi1, &addr, 1, 50);
  HAL_StatusTypeDef st2 = (st1 == HAL_OK) ? HAL_SPI_Receive(&hspi1, &val, 1, 50) : st1;

  RADIO_NSS_HIGH(rid);
  SPI_Unlock();

  if (st2 != HAL_OK) spi_err_count++;
  return val;
}

static void RADIO_WriteReg(uint8_t rid, uint8_t reg, uint8_t val)
{
  uint8_t buf[2] = { (uint8_t)(reg | 0x80), val };

  SPI_Lock();
  RADIO_NSS_LOW(rid);

