walczakkamil/lora_aprs_reapeter/STM32/Core/Src/main.c
  HAL_StatusTypeDef st = HAL_SPI_Transmit(&hspi1, buf, 2, 50);

  RADIO_NSS_HIGH(rid);
  SPI_Unlock();

  if (st != HAL_OK) spi_err_count++;
}

static void RADIO_ReadFifo(uint8_t rid, uint8_t *buf, uint8_t len)
{
  uint8_t addr = (uint8_t)(REG_FIFO & 0x7F);

  SPI_Lock();
  RADIO_NSS_LOW(rid);

  HAL_StatusTypeDef st1 = HAL_SPI_Transmit(&hspi1, &addr, 1, 50);
  HAL_StatusTypeDef st2 = (st1 == HAL_OK) ? HAL_SPI_Receive(&hspi1, buf, len, 200) : st1;

  RADIO_NSS_HIGH(rid);
  SPI_Unlock();

  if (st2 != HAL_OK) spi_err_count++;
}

static void RADIO_WriteFifo(uint8_t rid, const uint8_t *buf, uint8_t len)
{
  uint8_t addr = (uint8_t)(REG_FIFO | 0x80);

  SPI_Lock();
  RADIO_NSS_LOW(rid);

  HAL_StatusTypeDef st1 = HAL_SPI_Transmit(&hspi1, &addr, 1, 50);
  HAL_StatusTypeDef st2 = (st1 == HAL_OK) ? HAL_SPI_Transmit(&hspi1, (uint8_t*)buf, len, 200) : st1;

  RADIO_NSS_HIGH(rid);
  SPI_Unlock();

  if (st2 != HAL_OK) spi_err_count++;
}

/* =========================
   Helpers: Mode + Freq + IQ
   ========================= */
static void RADIO_SetMode(uint8_t rid, uint8_t mode)
{
  RADIO_WriteReg(rid, REG_OP_MODE, (uint8_t)(LONG_RANGE_MODE | mode));
}

static void RADIO_SetFrequency_Hz(uint8_t rid, uint32_t hz)
{
  // FRF = (hz << 19) / 32e6
  uint64_t frf = ((uint64_t)hz << 19) / 32000000ULL;
  RADIO_WriteReg(rid, REG_FRF_MSB, (uint8_t)(frf >> 16));
  RADIO_WriteReg(rid, REG_FRF_MID, (uint8_t)(frf >> 8));
  RADIO_WriteReg(rid, REG_FRF_LSB, (uint8_t)(frf >> 0));
}

static void RADIO_SetInvertIQ(uint8_t rid, uint8_t invert)
{
  if (!invert)
  {
    RADIO_WriteReg(rid, REG_INVERT_IQ,  0x27);
    RADIO_WriteReg(rid, REG_INVERT_IQ2, 0x1D);
  }
  else
  {
    RADIO_WriteReg(rid, REG_INVERT_IQ,  0x66);
    RADIO_WriteReg(rid, REG_INVERT_IQ2, 0x19);
  }
}

/* =========================
   Packet SNR/RSSI (debug)
   ========================= */
static int8_t RADIO_ReadPacketSNR_q4(uint8_t rid)
{
  return (int8_t)RADIO_ReadReg(rid, REG_PKT_SNR_VALUE);
}

static int16_t RADIO_ReadPacketRSSI_dBm(uint8_t rid)
{
  // approximate for 433MHz band
  uint8_t raw = RADIO_ReadReg(rid, REG_PKT_RSSI_VALUE);
  return (int16_t)raw - 157;
}

/* =========================
   LoRa init + RX start
   ========================= */
static void RADIO_RX_LoRaInit(uint8_t rid)
{
  RADIO_SetMode(rid, MODE_SLEEP);
  HAL_Delay(5);

  RADIO_WriteReg(rid, REG_FIFO_TX_BASE_ADDR, 0x00);
  RADIO_WriteReg(rid, REG_FIFO_RX_BASE_ADDR, 0x00);

  // LNA boost
  RADIO_WriteReg(rid, REG_LNA, (uint8_t)(RADIO_ReadReg(rid, REG_LNA) | 0x03));

  // SyncWord + modem config
  RADIO_WriteReg(rid, REG_SYNC_WORD, RX_LORA_SYNCWORD);

  // DIO mapping: DIO0=RxDone (LoRa)
  RADIO_WriteReg(rid, REG_DIO_MAPPING_1, 0x00);
  RADIO_WriteReg(rid, REG_DIO_MAPPING_2, 0x00);

  RADIO_WriteReg(rid, REG_MODEM_CONFIG_1, RX_LORA_BW_CR_EXPL);
  RADIO_WriteReg(rid, REG_MODEM_CONFIG_2, RX_LORA_SF_CRC);
  RADIO_WriteReg(rid, REG_MODEM_CONFIG_3, RX_LORA_MODEM_CFG3);

  RADIO_SetInvertIQ(rid, RX_LORA_INVERT_IQ);

  // Preamble = 8
  RADIO_WriteReg(rid, REG_PREAMBLE_MSB, 0x00);
  RADIO_WriteReg(rid, REG_PREAMBLE_LSB, 0x08);

  // DIO0 = RxDone
  uint8_t dmap1 = RADIO_ReadReg(rid, REG_DIO_MAPPING_1);
  dmap1 &= 0x3F;
  RADIO_WriteReg(rid, REG_DIO_MAPPING_1, dmap1);

  // clear IRQ
  RADIO_WriteReg(rid, REG_IRQ_FLAGS, 0xFF);

  RADIO_SetMode(rid, MODE_STDBY);
  HAL_Delay(5);
}

static void RADIO_RX_StartContinuous(uint8_t rid)
{
  RADIO_WriteReg(rid, REG_IRQ_FLAGS, 0xFF);
  RADIO_SetMode(rid, MODE_RX_CONTINUOUS);
}

/* =========================
   TX send on Radio2
   ========================= */
static void RADIO_TX_Send(uint8_t rid, const uint8_t *payload, uint8_t len)
{
  if (len == 0) return;

  RADIO_SetMode(rid, MODE_STDBY);
  HAL_Delay(1);

  // DIO0 = TxDone (LoRa): bits [7:6] = 01
  uint8_t dmap1 = RADIO_ReadReg(rid, REG_DIO_MAPPING_1);
  dmap1 = (uint8_t)((dmap1 & 0x3F) | 0x40);
  RADIO_WriteReg(rid, REG_DIO_MAPPING_1, dmap1);

  RADIO_WriteReg(rid, REG_IRQ_FLAGS, 0xFF);

  RADIO_WriteReg(rid, REG_FIFO_TX_BASE_ADDR, 0x00);
  RADIO_WriteReg(rid, REG_FIFO_ADDR_PTR, 0x00);

  RADIO_WriteFifo(rid, payload, len);
  RADIO_WriteReg(rid, REG_PAYLOAD_LENGTH, len);

  RADIO_SetMode(rid, MODE_TX);

  uint32_t t0 = HAL_GetTick();
  uint8_t tx_done = 0;

  while (HAL_GetTick() - t0 < 2000)
  {
    uint8_t irq = RADIO_ReadReg(rid, REG_IRQ_FLAGS);
    if (irq & IRQ_TX_DONE)
    {
      RADIO_WriteReg(rid, REG_IRQ_FLAGS, irq);
      tx_done = 1;
      break;
    }
  }

  /* TX się nie zakończył → reset całości */
  if (!tx_done)
  {
    system_panic_reset("TX stuck");
  }

  /* TX success indication: two short blinks */
  LED_Blink(2);

  /* R2 wraca do STDBY (oszczędność energii) */
  RADIO_SetMode(rid, MODE_STDBY);
}

/* =========================
   APRS print: HEX + ASCII (sanitized) with optional 3-byte header skip
   ========================= */
static void print_aprs_payload(uint8_t rid, const uint8_t *buf, uint8_t len)
{
#if (APP_LOG_LEVEL_DEFAULT < LOG_LEVEL_DEBUG)
  (void)rid; (void)buf; (void)len;
  return;
#endif

  uint8_t start = 0;

  /* Optional iGate header: 3C FF 01 */
  if (len > 3 && buf[0] == 0x3C && buf[1] == 0xFF && buf[2] == 0x01)
    start = 3;

  char *out = g_aprs_out;
  int pos = 0;

  pos += snprintf(out + pos, sizeof(g_aprs_out) - pos,
                  "R%u HEX:", (unsigned)rid);
  for (uint8_t i = 0; i < len && pos < (int)sizeof(g_aprs_out) - 4; i++)
    pos += snprintf(out + pos, sizeof(g_aprs_out) - pos,
                    " %02X", buf[i]);
  pos += snprintf(out + pos, sizeof(g_aprs_out) - pos, "\r\n");

  LOGD("%s", out);

  pos = 0;
  pos += snprintf(out + pos, sizeof(g_aprs_out) - pos,
                  "R%u ASCII: ", (unsigned)rid);

  for (uint8_t i = start; i < len && pos < (int)sizeof(g_aprs_out) - 3; i++)
  {
    uint8_t c = buf[i];
    out[pos++] = (c >= 32 && c <= 126) ? (char)c : '.';
  }

  out[pos++] = '\r';
  out[pos++] = '\n';

  LOGD("%s", out);
}

/* =========================
   Odbiór pakietu dla danego radia (RX_DONE)
   ========================= */
static void RADIO_RX_ProcessIfAny(uint8_t rid)
{
  uint8_t irq = RADIO_ReadReg(rid, REG_IRQ_FLAGS);

  // tylko ValidHeader/Timeout -> czyścimy i wracamy
  if ((irq & (IRQ_RX_DONE | IRQ_PAYLOAD_CRC_ERROR)) == 0)
  {
    if (irq & (IRQ_VALID_HEADER | IRQ_RX_TIMEOUT))
      RADIO_WriteReg(rid, REG_IRQ_FLAGS, (uint8_t)(IRQ_VALID_HEADER | IRQ_RX_TIMEOUT));
    return;
  }

  // Czyścimy IRQ dopiero po RxDone/CRC error
  RADIO_WriteReg(rid, REG_IRQ_FLAGS, 0xFF);

