walczakkamil/lora_aprs_reapeter/STM32/Core/Src/main.c
  if (irq & IRQ_PAYLOAD_CRC_ERROR)
  {
    if (++crc_storm > 10)
      system_panic_reset("CRC storm");
  }
  else
  {
    crc_storm = 0;
  }

  // RX DONE
  uint8_t cur = RADIO_ReadReg(rid, REG_FIFO_RX_CURRENT);
  RADIO_WriteReg(rid, REG_FIFO_ADDR_PTR, cur);

  uint8_t len = RADIO_ReadReg(rid, REG_RX_NB_BYTES);
  if (len > 128) len = 128;

  uint8_t *buf = (rid == RID_RX1) ? g_rx_buf_1 : g_rx_buf_2;
  memset(buf, 0, 128);
  RADIO_ReadFifo(rid, buf, len);

  int16_t rssi = RADIO_ReadPacketRSSI_dBm(rid);
  int8_t snr_q4 = RADIO_ReadPacketSNR_q4(rid);

  int8_t snr_int = (int8_t)(snr_q4 / 4);
  uint8_t snr_frac = (uint8_t)(snr_q4 & 0x03);
  const char *snr_frac_txt = (snr_frac == 0) ? "00" : (snr_frac == 1) ? "25" : (snr_frac == 2) ? "50" : "75";

  uart_printf("R%u RX DONE: len=%u RSSI=%ddBm SNR=%d.%s dB\r\n",
              (unsigned)rid, (unsigned)len, (int)rssi, (int)snr_int, snr_frac_txt);

  print_aprs_payload(rid, buf, len);

  /* Forwarding: Radio1 RX -> queue TX on Radio2 (same bytes) */
  if (rid == RID_RX1)
  {
    if (!g_tx_pending_2)
    {
      g_tx_len_2 = len;
      memcpy((void*)g_tx_buf_2, buf, len);
      g_tx_pending_2 = 1;
    }
    else
    {
      uart_puts("R1 RX: TX queue busy -> drop\r\n");
    }
  }

  LED_Blink(1);
}

/** @brief EXTI flags set in HAL_GPIO_EXTI_Callback() and consumed in the main loop. */
static volatile uint8_t rx1_dio0_flag = 0;
static volatile uint8_t rx2_dio0_flag = 0;

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  if (GPIO_Pin == RX1_DIO0_Pin) rx1_dio0_flag = 1;
}

/* =========================================================
   main
   ========================================================= */
int main(void)
{
  HAL_Init();
  SystemClock_Config();
  MX_GPIO_Init();
  MX_USART1_UART_Init();
  MX_SPI1_Init();

  LOG_InitFromConfig();

  if (HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_12) == GPIO_PIN_RESET)
  {
    UART_LogEnable(1);
    LOG_SetLevel(LOG_LEVEL_DEBUG);
    uart_raw_tx((uint8_t*)"DEBUG PIN ACTIVE\r\n", 18);
  }

  uart_puts("\r\n=== DUAL SX127x (RX1 RX, RX2 TX-FWD) START ===\r\n");

  // oba CS w high
  RADIO_NSS_HIGH(RID_RX1);
  RADIO_NSS_HIGH(RID_RX2);
  HAL_Delay(20);

  uart_puts("Reset RX1...\r\n");
  RADIO_Reset(RID_RX1);
  uart_puts("Reset RX2...\r\n");
  RADIO_Reset(RID_RX2);

  uint8_t v1 = RADIO_ReadReg(RID_RX1, REG_VERSION);
  uint8_t v2 = RADIO_ReadReg(RID_RX2, REG_VERSION);
  uart_printf("RX1 RegVersion=0x%02X\r\n", v1);
  uart_printf("RX2 RegVersion=0x%02X\r\n", v2);

  uart_printf("R1 freq=%luHz, R2 freq=%luHz BW125 SF9 CR4/7 Sync=0x%02X\r\n",
              (unsigned long)RX1_LORA_FREQ_HZ, (unsigned long)RX2_LORA_FREQ_HZ, (unsigned)RX_LORA_SYNCWORD);

  // init + start RX na obu
  RADIO_RX_LoRaInit(RID_RX1);
  RADIO_SetFrequency_Hz(RID_RX1, RX1_LORA_FREQ_HZ);
  RADIO_RX_StartContinuous(RID_RX1);

  RADIO_RX_LoRaInit(RID_RX2);
  RADIO_SetFrequency_Hz(RID_RX2, RX2_LORA_FREQ_HZ);
  /* R2 stays in STDBY until TX */
  RADIO_SetMode(RID_RX2, MODE_STDBY);

  LED_OFF();

  if (v1 == 0x00 || v1 == 0xFF)
  {
    system_panic_reset("SX127x RX1 no response");
  }
  if (v2 == 0x00 || v2 == 0xFF)
  {
    system_panic_reset("SX127x RX2 no response");
  }

  uart_puts("Start RX continuous on RX1 and RX2...\r\n");

  uint32_t last_poll = HAL_GetTick();
  uint32_t log_boot_t0 = HAL_GetTick();
  uint8_t  log_force_on = 0;
#if (APP_LOG_SERVICE_PIN_ENABLE)
  if (HAL_GPIO_ReadPin(APP_LOG_SERVICE_GPIO_Port, APP_LOG_SERVICE_Pin) == APP_LOG_SERVICE_PIN_ACTIVE) log_force_on = 1;
#endif

  while (1)
  {
    /* Handle scheduled LED blinks (RX=1, TX=2) */
    LED_Task();

    static uint32_t last_led = 0;
    if (HAL_GetTick() - last_led > 500)
    {
      last_led = HAL_GetTick();
      // HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin); // opcjonalnie
    }


    /* Optional: auto-mute logs after boot (saves power / reduces UART spam) */
#if (APP_LOG_AUTO_MUTE_MS > 0u)
    if (!log_force_on && g_uart_log_enabled && (HAL_GetTick() - log_boot_t0 >= APP_LOG_AUTO_MUTE_MS))
    {
      UART_LogEnable(0);
    }
#endif

    // EXTI-driven
    if (rx1_dio0_flag) { rx1_dio0_flag = 0; RADIO_RX_ProcessIfAny(RID_RX1); }

    /* TX forwarding: if R1 queued a packet, transmit it on Radio2 */
    if (g_tx_pending_2)
    {
      uint8_t len = g_tx_len_2;
      g_tx_pending_2 = 0;

      uart_printf("R2 TX: forwarding %u bytes\r\n", (unsigned)len);
      RADIO_TX_Send(RID_RX2, g_tx_buf_2, len);
    }

    // polling co ~50ms (działa nawet bez EXTI w it.c)
    if (HAL_GetTick() - last_poll >= 50)
    {
      last_poll = HAL_GetTick();
      RADIO_RX_ProcessIfAny(RID_RX1);
    }

    // restarts on spi errors
    if (spi_err_count > 50)
    {
      system_panic_reset("SPI error storm");
    }
  }
}

/* =========================================================
   Minimalne inicjalizacje (jeśli masz CubeMX, możesz zostawić swoje)
   ========================================================= */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI_DIV2;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL16; // 64MHz
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) { Error_Handler(); }

  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK|RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK) { Error_Handler(); }
}

static void MX_GPIO_Init(void)
{
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_AFIO_CLK_ENABLE();

  GPIO_InitTypeDef GPIO_InitStruct = {0};

