walczakkamil/lora_aprs_reapeter/STM32/Core/Src/main.c
  // NSS outputs
  HAL_GPIO_WritePin(RX1_NSS_GPIO_Port, RX1_NSS_Pin, GPIO_PIN_SET);
  HAL_GPIO_WritePin(RX2_NSS_GPIO_Port, RX2_NSS_Pin, GPIO_PIN_SET);

  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;

  GPIO_InitStruct.Pin = RX1_NSS_Pin;
  HAL_GPIO_Init(RX1_NSS_GPIO_Port, &GPIO_InitStruct);

  GPIO_InitStruct.Pin = RX2_NSS_Pin;
  HAL_GPIO_Init(RX2_NSS_GPIO_Port, &GPIO_InitStruct);

  // RESET outputs
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;

  GPIO_InitStruct.Pin = RX1_RST_Pin;
  HAL_GPIO_Init(RX1_RST_GPIO_Port, &GPIO_InitStruct);

  GPIO_InitStruct.Pin = RX2_RST_Pin;
  HAL_GPIO_Init(RX2_RST_GPIO_Port, &GPIO_InitStruct);

  HAL_GPIO_WritePin(RX1_RST_GPIO_Port, RX1_RST_Pin, GPIO_PIN_SET);
  HAL_GPIO_WritePin(RX2_RST_GPIO_Port, RX2_RST_Pin, GPIO_PIN_SET);


#if (APP_LOG_SERVICE_PIN_ENABLE)
  /* Service pin input (used to force logging ON at boot). Adjust Pull as needed. */
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLUP; /* common: button/jumper to GND */
  GPIO_InitStruct.Pin = APP_LOG_SERVICE_Pin;
  HAL_GPIO_Init(APP_LOG_SERVICE_GPIO_Port, &GPIO_InitStruct);
#endif

// DIO0 inputs with EXTI rising
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;

  GPIO_InitStruct.Pin = RX1_DIO0_Pin;
  HAL_GPIO_Init(RX1_DIO0_GPIO_Port, &GPIO_InitStruct);

  // LED output
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Pin = LED_Pin;
  HAL_GPIO_Init(LED_GPIO_Port, &GPIO_InitStruct);
  /* Default LED state: OFF (saves power) */
  HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);

  // NVIC for EXTI lines (RX1 on PB1 -> EXTI1, RX2 on PB11 -> EXTI15_10)
  HAL_NVIC_SetPriority(EXTI1_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(EXTI1_IRQn);

  HAL_NVIC_SetPriority(EXTI15_10_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);

  GPIO_InitStruct.Pin  = GPIO_PIN_12;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
}

static void MX_SPI1_Init(void)
{
  __HAL_RCC_SPI1_CLK_ENABLE();

  hspi1.Instance = SPI1;
  hspi1.Init.Mode = SPI_MODE_MASTER;
  hspi1.Init.Direction = SPI_DIRECTION_2LINES;
  hspi1.Init.DataSize = SPI_DATASIZE_8BIT;
  hspi1.Init.CLKPolarity = SPI_POLARITY_LOW;
  hspi1.Init.CLKPhase = SPI_PHASE_1EDGE;
  hspi1.Init.NSS = SPI_NSS_SOFT;
  hspi1.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_16;
  hspi1.Init.FirstBit = SPI_FIRSTBIT_MSB;
  hspi1.Init.TIMode = SPI_TIMODE_DISABLE;
  hspi1.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;

  if (HAL_SPI_Init(&hspi1) != HAL_OK) Error_Handler();
}

static void MX_USART1_UART_Init(void)
{
  __HAL_RCC_USART1_CLK_ENABLE();

  huart1.Instance = USART1;
  huart1.Init.BaudRate = 115200;
  huart1.Init.WordLength = UART_WORDLENGTH_8B;
  huart1.Init.StopBits = UART_STOPBITS_1;
  huart1.Init.Parity = UART_PARITY_NONE;
  huart1.Init.Mode = UART_MODE_TX_RX;
  huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart1.Init.OverSampling = UART_OVERSAMPLING_16;

  if (HAL_UART_Init(&huart1) != HAL_OK) Error_Handler();
}

void Error_Handler(void)
{
  __disable_irq();
  while(1) {}
}
